dognatekilo/app/controllers/members_controller.rb

SELECT "supplies".* FROM "supplies"
SELECT "categories".* FROM "categories"
SELECT "wishlists".* FROM "wishlists"
---
  def index
  	if user_signed_in?
  		session[:id] = current_user.id
      @user = current_user
      @supply = current_user.supplies.new
      @wishlist = current_user.wishlists.new
  	end
  	@supplies = Supply.search(params[:search]).order(supply_sort_column + " " + supply_sort_direction).paginate(:per_page => 3, :page => params[:page])
    @categories = Category.all
    @wishlists = Wishlist.search(params[:search]).order(wish_sort_column + " " + wish_sort_direction).paginate(:per_page => 2, :page => params[:page])